       IDENTIFICATION DIVISION.
       PROGRAM-ID. AgeStat.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  MAX-AGE               PIC 99 VALUE ZEROS.
       01  MIN-AGE               PIC 99 VALUE 99.
       01  AGE-VALUE             PIC 99 VALUE ZEROS.
       01  AGE-COUNT             PIC 99 VALUE ZEROS.

       01  SQL-STATUS            PIC S9(4) COMP-5 VALUE ZEROS.

OCESQL*EXEC SQL BEGIN DECLARE SECTION END-EXEC.
       01  DBNAME               PIC X(30) VALUE 'country'.
       01  USERNAME             PIC X(30) VALUE 'cobol'.
       01  PASSWD               PIC X(10) VALUE SPACE.

       01  SQL-AGE-RESULT.
           05  MAX-AGE-VALUE    PIC 99.
           05  MIN-AGE-VALUE    PIC 99.

       01  SQL-AGE-COUNT-RESULT.
           05  SQL-AGE-VALUE   PIC 99.
           05  SQL-AGE-COUNT   PIC 99.

OCESQL*EXEC SQL END DECLARE SECTION END-EXEC.

OCESQL*EXEC SQL INCLUDE SQLCA END-EXEC.
OCESQL     copy "sqlca.cbl".

OCESQL*
OCESQL 01  SQ0001.
OCESQL     02  FILLER PIC X(014) VALUE "DISCONNECT ALL".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0002.
OCESQL     02  FILLER PIC X(039) VALUE "SELECT MAX(age), MIN(age) FROM"
OCESQL  &  " databank".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
OCESQL 01  SQ0003.
OCESQL     02  FILLER PIC X(066) VALUE "SELECT age, COUNT( * ) FROM da"
OCESQL  &  "tabank GROUP BY age ORDER BY age ASC".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
       PROCEDURE DIVISION.
       1000-MAIN-START.
OCESQL*    EXEC SQL
OCESQL*        CONNECT :USERNAME IDENTIFIED BY :PASSWD USING :DBNAME
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLConnect" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE USERNAME
OCESQL          BY VALUE 30
OCESQL          BY REFERENCE PASSWD
OCESQL          BY VALUE 10
OCESQL          BY REFERENCE DBNAME
OCESQL          BY VALUE 30
OCESQL     END-CALL.

           IF SQLCODE NOT = ZERO 
               PERFORM 1001-ERROR-RTN-START
                   THRU 1001-ERROR-RTN-END
           END-IF.

           PERFORM 3001-GET-MAX-MIN-AGE
               THRU 3001-GET-MAX-MIN-AGE-END.

           PERFORM 4001-GET-AGE-COUNT
               THRU 4001-GET-AGE-COUNT-END.

       1000-MAIN-END.
OCESQL*    EXEC SQL COMMIT WORK END-EXEC.
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "COMMIT" & x"00"
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL.
OCESQL*    EXEC SQL DISCONNECT ALL END-EXEC.
OCESQL     CALL "OCESQLDisconnect" USING
OCESQL          BY REFERENCE SQLCA
OCESQL     END-CALL.
           STOP RUN.
      ******************************************************************
       1001-ERROR-RTN-START.
           DISPLAY "*** SQL ERROR ***".
           DISPLAY "SQLCODE: " SQLCODE SPACE.
           EVALUATE SQLCODE
              WHEN  +100
                 DISPLAY "Record not found"
              WHEN  -01
                 DISPLAY "Connection failed"
              WHEN  -20
                 DISPLAY "Internal error"
              WHEN  -30
                 DISPLAY "Database error"
                 DISPLAY "ERRCODE:" SPACE SQLSTATE
                 DISPLAY SQLERRMC
OCESQL*          EXEC SQL
OCESQL*              ROLLBACK
OCESQL*          END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLExec" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "ROLLBACK" & x"00"
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL
              WHEN OTHER
                 DISPLAY "Undefined error"
                 DISPLAY "ERRCODE:" SPACE SQLSTATE
                 DISPLAY SQLERRMC
           END-EVALUATE.
       1001-ERROR-RTN-END.
           STOP RUN.
      ******************************************************************
       3001-GET-MAX-MIN-AGE.
OCESQL*    EXEC SQL
OCESQL*        SELECT MAX(age), MIN(age)
OCESQL*        INTO :MAX-AGE-VALUE, :MIN-AGE-VALUE
OCESQL*        FROM databank
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 2
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE MAX-AGE-VALUE
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 2
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE MIN-AGE-VALUE
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecSelectIntoOne" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0002
OCESQL          BY VALUE 0
OCESQL          BY VALUE 2
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL.

           MOVE MAX-AGE-VALUE TO MAX-AGE.
           MOVE MIN-AGE-VALUE TO MIN-AGE.

           DISPLAY 'Min Age: ' MIN-AGE.
           DISPLAY 'Max Age: ' MAX-AGE.
       3001-GET-MAX-MIN-AGE-END.
      ******************************************************************
       4001-GET-AGE-COUNT.
           DISPLAY 'Age Counts: '.
OCESQL*    EXEC SQL DECLARE AGE_CUR CURSOR FOR
OCESQL*        SELECT age, COUNT(*)
OCESQL*        FROM databank
OCESQL*        GROUP BY age
OCESQL*        ORDER BY age ASC
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLCursorDeclare" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "AgeStat_AGE_CUR" & x"00"
OCESQL          BY REFERENCE SQ0003
OCESQL     END-CALL.

OCESQL*    EXEC SQL OPEN AGE_CUR END-EXEC.
OCESQL     CALL "OCESQLCursorOpen" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "AgeStat_AGE_CUR" & x"00"
OCESQL     END-CALL.

           PERFORM UNTIL SQLCODE = +100
OCESQL*        EXEC SQL
OCESQL*            FETCH AGE_CUR
OCESQL*            INTO :SQL-AGE-VALUE, :SQL-AGE-COUNT
OCESQL*        END-EXEC
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 2
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE SQL-AGE-VALUE
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 1
OCESQL          BY VALUE 2
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE SQL-AGE-COUNT
OCESQL     END-CALL
OCESQL     CALL "OCESQLCursorFetchOne" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "AgeStat_AGE_CUR" & x"00"
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL

               IF SQLCODE = 0 THEN
                   DISPLAY 'Age ' SQL-AGE-VALUE ': ' SQL-AGE-COUNT
               END-IF
           END-PERFORM.

OCESQL*    EXEC SQL CLOSE AGE_CUR END-EXEC.
OCESQL     CALL "OCESQLCursorClose"  USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE "AgeStat_AGE_CUR" & x"00"
OCESQL     END-CALL
OCESQL    .
       4001-GET-AGE-COUNT-END.
      ******************************************************************
      ******************************************************************
      ******************************************************************
